<?php
	include_once 'post-comment.php';
?>
<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8">
	<title>"Малкият принц"</title>
	<link href="style2.css" rel="stylesheet">
	<script type="text/javascript" src="script.js"></script>
</head>
<body>
	<body class="books">
<div class="cont">
	<input type="checkbox" id="c1">
	<input type="checkbox" id="c2">
	<input type="checkbox" id="c3">
	<div id="cover">
	<img src="images/CD-Little-Prince-6cm.jpg" alt="Снимка на корицата на книгата "Малкият принц">
	</div>

	<div class="page-cont">
		<div class="page" id="p1">
			<img src="images/book-page.jpg">
			<div class="back">
				<label class="but-back" for="c1">Назад</label>
			</div>
			<div class="front">
			<h1>"Малкият принц"</h1>
			<h3>Кратко описание</h3>
			<p>Тази малка приказка е нещо повече от художествена творба. Като всеки литературен шедьовър тя далеч е надхвърлила жанровите си граници. Историята на странното златокосо момче и неговия случаен възрастен приятел е прелестна притча, за живота и смъртта, любовта и раздялата, красотата и преходността.</p>

			<h3>Пълно описание</h3>
			<p>Малкият принц е книга, публикувана за първи път през 1943 година, с автор Антоан дьо Сент-Екзюпери и представлява неговото най-известно произведение. Той я написва, докато отсяда в един хотел в Ню Йорк през 1942 г. Като форма и жанр книгата няма аналог в световната литература. Тя е поетичен и философски разказ под привидното впечатление на приказка за деца, но в същото време съдържа дълбоки и идеалистични мисли за живота, любовта и смъртта. Книгата е писана по лични преживявания на летеца-писател и е илюстрирана с негови рисунки, които са включени в повечето издания. Авторът споделя мислите си за безумията на човечеството и простите мъдрости, които възрастните забравят, когато пораснат. Във всяка глава на книгата малкият принц се среща с различен герой, който може да се разглежда като алегория на даден парадокс или абсурд от света на възрастните. Езикът е прост и обикновен, но в същото време със силно изразена символика. Илюстрациите на книгата, подобни на детски рисунки, са добро допълнение към чистотата и простотата на езика. Книгата може да се разглежда като опит за намиране на детето във всеки възрастен: „Всички възрастни са били преди това деца, но много малко от тях си го спомнят.“</p>
			<label class="but-next" for="c1">Следваща</label>
		</div>
	</div>

	<div class="page" id="p2">
			<img src="images/book-page.jpg">
			<div class="back">
				<label class="but-back" for="c2">Назад</label>
			</div>
			<div class="front">
				<h3 class="h3-al">Потребителски ревюта</h3>
				<div id="myDIV">
				<?php
				$sql = "SELECT * FROM reviews5book;";
				$result = mysqli_query($conn, $sql);
				$resultCheck = mysqli_num_rows($result);

				if ($resultCheck > 0) {
					while ($row = mysqli_fetch_assoc($result)) {
						echo $row['comment']. "<br><br>";
					}
				}
			?>
	<p>Епитомът на детска книга за възрастни, Малкият принц докосва читателя по начин, който оставя траен белег в душата. Книгата няма да остави никого безразличен и полюсните мнения за нея имат един и същи корен - всеки читател ще разпознае себе си или поне частица от съзнанието и мислите си в това малко огледало, което Екзюпери е създал. В тази тънка книжка с илюстрации е вплетена плетора от образи - всичките живи, трогателни, познати и... истински.
	</p>

	<p>Класика, класика, класика! <br>
			Определено е нужно да я прочетеш в различни периоди от живота си, за да осъзнаеш красота й и вникнеш в истинския смисъл на нещата, които понякога приемаме за даденост през погледа на едно дете. <br>
			" ...Единствено със сърцето се вижда добре.Най-важното е невидимо за очите.
	</p>

	<p>Казват, че тази книга трябва да се прочете няколко пъти през живота. Е, аз я прочетох сега за първи. Стана ми някак топло и приятно на душата, почувствах се оптимист. Ще я препрочета отново някога в близко или далечно бъдеще за да видя дали ще открия и друг смисъл в нея.
	</p>
</div>
	<label class="but-next" for="c2">Следваща</label>
		</div>
	</div>

	<div class="page" id="p3">
			<h3>End</h3>
			<div class="back">
				<label class="but-back" for="c3">Назад</label>
			</div>
			<div class="front">
				<h3 class="last">Форма за изпращане на ревю</h3>
							<div id="myDIV">
							<form action = "insert5.php" method = "post">
						      <input type="text" id="myText" name="comment_5">
							  <input type="submit" class="btn btn-primary" name="submit5" value="Сподели" onclick="myFunction()">
						      </div>
			</form>
				<h3 class="last">Цена: 16.90лв.</h3>
				<h3 class="last">Форма за закупуване</h3>
				<div class="buy_form">
					<form action="book5pur.php" method="post">
				    <input type="text" id="name" name="name" placeholder="Име" value="">
				    <input type="text" id="address" name="address" placeholder="Адрес" value="">
				    <br>
				   	<input type="submit" class="btn2" name="send" value="Изпрати" onclick="pop()">
				</div>
				<label class="but-next" for="c3">Следваща</label>
</body>
</html>