<?php
	include_once 'post-comment.php';
?>
<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8">
	<title>"Звезден полет"</title>
	<link href="style2.css" rel="stylesheet">
	<script type="text/javascript" src="script.js"></script>
</head>
<body class="books">
<div class="cont">
	<input type="checkbox" id="c1">
	<input type="checkbox" id="c2">
	<input type="checkbox" id="c3">
	<div id="cover">
		<img src="images/179c2aea5f4ce48df9113b39268d901d.jpg" alt="Снимка на корицата на книгата "Звезден полет">
	</div>

	<div class="page-cont">
		<div class="page" id="p1">
			<img src="images/book-page.jpg">
			<div class="back">
				<label class="but-back" for="c1">Назад</label>
			</div>
			<div class="front">
				<h1>"Звезден полет"</h1>
				<h3>Кратко описание</h3>
				<p> “Звезден полет” е едно напрегнато пътешествие в открития космос в компанията на момиче с престъпно минало, момче, наследник на голяма корпорация, по настоящем – преследвано от закона, принцеса, избягала от воюващо кралство, загадъчен тип със свежо чувство за хумор, крадец с изключително добра душа и капитан готов да даде живота си за своя екипаж... А да, и  в компанията на много опасни бандити, които постоянно вървят по петите им.</p>

				<h3>Пълно описание</h3>
				<p>Животът в далечните райони на галактиката е мъчна битка, изпълнена с опасности и беззаконие, и Солара Брукс няма търпение да го започне. Отгледана от монахини в сиропиталище на Земята, изкарваща прехраната си като механик, тя копнее за шанс да започне начисто някъде, където никого не го е грижа, че има машинно масло под ноктите… и татуировки на бивш затворник по кокалчетата на пръстите. В отчаянието си да се добере до далечните райони Солара се съгласява да стане прислужник на борда на интергалактически кораб, който да я откара възможно най-близо. За нещастие се оказва, че трябва да отговаря на прищевките на Доран Сполдинг, наследник на междугалактическа петролна компания, стар познайник на Солара от миналото. А сега, както и преди, единствената му мисия, изглежда, е да ѝ вгорчи живота. Но по стечение на обстоятелствата двамата се оказват вързани един за друг и на борда на "Банши" – кораб със съмнителна репутация. Докато Солара се бори за оцеляването им, опитвайки се да разбере доколко може да се довери на банда загадъчни пирати, Доран научава, че е замесен в интерпланетарна конспирация, започнала на Земята. А той също крие свои тайни. Тайни и координати към мистериозна планета...</p>
				<label class="but-next" for="c1">Следваща</label>
		</div>
	</div>

<div class="page" id="p2">
			<img src="images/book-page.jpg">
			<div class="back">
				<label class="but-back" for="c2">Назад</label>
			</div>
			<div class="front">
				<h3 class="h3-al">Потребителски ревюта</h3>
				<div id="myDIV">
				<?php
				$sql = "SELECT * FROM reviews2book;";
				$result = mysqli_query($conn, $sql);
				$resultCheck = mysqli_num_rows($result);

				if ($resultCheck > 0) {
					while ($row = mysqli_fetch_assoc($result)) {
						echo $row['comment']. "<br><br>";
					}
				}
	?>
	<p>
			Виждайки корицата и по името няма как първата ви асоциация да не е „история развиваща се в космоса“ – но определено не точно типичната история. Добре, признавам си, че я започнах с едно на ум. Но тъй като книгата получи доста положителни ревюта от световно известни booktube-ри – силно исках да видя, защо е този шум около книгата.
	</p>

	<p>
			Фантастична, във всеки смисъл на думата, "Звезден полет" е книга, която безпощадно крадеше всяка свободна секунда от времето ми и която също толкова безпощадно ме остави с купища въпроси без отговори след края си. А сега ми остава единствено да се надявам издателство Ciela да издадат нейното, надявам се, дори по-вълнуващо продължение възможно най-скоро.
	</p>

	<p>
			Започнах я без да знам какво да очаквам, нито дали ще ми хареса. Е, без колебание мога да кажа, че я обичам! Оригинален и вълнуващ сюжет, примесен с постоянно действие, силни герои, които израстват с всеки изминал ден и загадки с неочаквани разкрития - това е "Звезден полет" на Мелиса Ландърс. С огромно нетърпение очаквам продължението!
	</p>
	
</div>
	<label class="but-next" for="c2">Следваща</label>
		</div>
	</div>

<div class="page" id="p3">
			<div class="back">
				<label class="but-back" for="c3">Назад</label>
			</div>
			<div class="front">
				<h3 class="last">Форма за изпращане на ревю</h3>
							<div id="myDIV">
							<form action = "insert2.php" method = "post">
						      <input type="text" id="myText" name="comment_2">
							  <input type="submit" class="btn btn-primary" name="submit2" value="Сподели" onclick="myFunction()">
						      </div>
			</form>
				<h3 class="last">Цена: 14.90лв.</h3>
				<h3 class="last">Форма за закупуване</h3>
				<div class="buy_form">
					<form action="book2pur.php" method="post">
				    <input type="text" id="name" name="name" placeholder="Име" value="">
				    <input type="text" id="address" name="address" placeholder="Адрес" value="">
				    <br>
				   	<input type="submit" class="btn2" name="send" value="Изпрати" onclick="pop()">
				</div>
				<label class="but-next" for="c3">Следваща</label>
</body>
</html>